[
  {
    "_id": "681b4bc01757f134e0d2c996",
    "title": "E-ROBOT v2 - Erovouika Line following Intermediate",
    "description": "Get ready for the ultimate test of speed and ingenuity! Erovoutika is thrilled to present an electrifying line-following robot competition open to all senior high school and college students.",
    "imageUrl": "/uploads/1746625966937.jpg",
    "mechanics": [
      "1.1 The competition is open to all senior high school or college students. Participants must provide proof of their enrollment status upon request, and any participant found ineligible will be disqualified from the event.",
      "1.2 All participants must register for the competition before the designated deadline. Any participant who has not registered will not be allowed to compete. Participants must provide all necessary information.",
      "1.3 The project to be created is a line-following robot and it will be racing a line track provided by Erovoutika.",
      "1.4 The objective of the competition is to run the line-following robot on the line track provided by Erovoutika and have the fastest time record completing 2-3 laps.",
      "1.5 The competition has no restrictions on the software that the participants may use.",
      "1.6 The robotics kit and the line track will be provided by ERovoutika.",
      "1.7 In the competition proper, the line-following robots will go against each other in a double-elimination tournament, wherein a participant gets eliminated upon having lost two games or matches. There will be separate brackets for the winners and losers.",
      "1.8 In the competition proper, the line-following robots will go against each other in a double-elimination tournament, wherein a participant gets eliminated upon having lost two games or matches. There will be separate brackets for the winners and losers.",
      "1.9 By participating, all participants automatically agree that they vow to respect fellow participants and staff"
    ],
    "generalConduct": [
      "2.1 Players are expected to conduct themselves and compete with the spirit of sportsmanship, maintaining a friendly and polite demeanor in activities involving other participants and the public in general.",
      "2.2 The organizer/ facilitators have the right to apply penalties, disqualify, and dismiss any registered participants from the competition at their discretion at any stage."
    ],
    "generalRules": [
      "3.1 All participants must arrive and be ready at the competition venue at least 30 minutes before the scheduled start time. Latecomers will not be permitted to compete and will be disqualified from the event. Any participant unable to attend the competition due to unforeseen circumstances must notify the organizers immediately.",
      "3.2 All participants must stay within the venue once the event begins. Leaving the venue during the competition is prohibited, and any participant who does so will be disqualified.",
      "3.3 All projects submitted for the competition must be created using only the components and materials in the designated robotics kit. Any additional components or materials are prohibited.",
      "3.4 Once the event starts, all participating groups are prohibited from communicating with any other groups until the competition ends. Any attempt to communicate or collaborate with other groups will result in immediate disqualification.",
      "3.5 Facilitators reserve the right to edit the rules any time and disqualify teams for reasons not stated. in this list or take other action.",
      "3.6 Ignorance of rules does not justify rule-breaking. If you have questions about any rules, contact our support."
    ],
    "participantsRequirement": [
      "4.1 Participants must adhere to a code of conduct that outlines expected behavior during the event, such as respect for other participants, non-discrimination, and ethical conduct.",
      "4.2 Participants are encouraged to leverage their creativity and knowledge to develop innovative solutions in designing the fastest line-following robot.",
      "4.3 Participants must adhere to rules related to intellectual property rights, which could include restrictions on the use of copyrighted materials or ownership of the intellectual property developed during the event.",
      "4.4 Participants must adhere to health and safety regulations, such as wearing protective gear or following safety procedures when working with hazardous materials or equipment."
    ],
    "teamRequirement": [
      "5.1 All participants must form teams of a maximum of two (2) members. Upon registration, participants who do not have a team will be assigned to a team by the organizers. If feasible, Teams will be created randomly or based on participant preferences. Participants may also have a maximum of one (1) coach.",
      "5.2 Participants may request to change teams before the start of the competition, but the organizers reserve the right to deny such requests. Each team will be given a team name and must work together throughout the competition."
    ],
    "__v": 0,
    "showGeneralConduct": true,
    "showGeneralRules": true,
    "showMechanics": true,
    "showParticipantsRequirement": true,
    "showTeamRequirement": true
  },
  {
    "_id": "681b53b465b347254b1ae7e5",
    "title": "FREESTYLE",
    "description": "showcase your creativity and technical prowess in the Freestyle Exhibition!",
    "imageUrl": "/uploads/1746625973093.jpg",
    "mechanics": [
      "Each participant is invited to create a poster (maximum format A1 portrait) which will be presented in the Freestyle Exhibition together with the robot or the electronic project. There are no limitations to the design of the poster.",
      "During the Freestyle Exhibition (a day or two of competition) participants must be available to answer questions from all interested public. The host is not responsible for theft, damage or destruction of the machine or project during the exhibition",
      "!!PRESENTATION IN FRONT OF A JURY!!",
      "The jury will be composed of teachers and industry representatives and a member of the team coordinating the project.",
      "Jury members will ask questions after visiting and listening to the Freestyle Exhibition presentation before the evaluation session. During the assessment the team will show the robot or the project and they will submit to the jury:",
      "The robot or electronic /mechanical project",
      "The poster",
      "Demonstrations of operation of the robot",
      "Will answer questions from the jury",
      "A presentation before the jury and public"
    ],
    "generalConduct": [],
    "generalRules": [],
    "participantsRequirement": [],
    "teamRequirement": [],
    "__v": 0,
    "showGeneralConduct": false,
    "showGeneralRules": false,
    "showMechanics": true,
    "showParticipantsRequirement": false,
    "showTeamRequirement": false
  },
  {
    "_id": "681b554165b347254b1ae7f4",
    "title": "EROVOUTHON",
    "description": "Erovoutika is pleased to introduce EROVOUTHON, a thrilling competition that challenges college and senior high school students to produce meaningful projects.",
    "imageUrl": "/uploads/1746625977756.jpg",
    "mechanics": [
      "1.1 The competition is open to all students who are currently enrolled in senior high school or college. Participants must be able to provide proof of their enrollment status upon request, and any participant found to be ineligible will be disqualified from the event.",
      "1.2 All participants must register for the competition before the designated deadline. Any participant who has not registered will not be allowed to compete. Participants must provide all necessary information.",
      "1.3 The project to be created must demonstrate a clear positive impact on the environment or community with the following technology-integrations:",
      "●Bluetooth",
      "●IoT",
      "●GSM",
      "●Camera Image Processing and Computer Vision",
      "1.4 The competition has no restrictions on the tools, applications, or software that participants may use.",
      "1.5 The participants will be given 6 hours to finish their building and programming of the robot with environmental or community applications.",
      "1.6 The team will present their output after the given time by the Judges to build their robot.",
      "1.7 By participating, all participants automatically agree that they vow to respect fellow participants and staff."
    ],
    "generalConduct": [
      "2.1 Players are expected to conduct themselves and compete with the spirit of sportsmanship, maintaining a friendly and polite demeanor in activities involving other participants and the public in general.",
      "2.2 The organizer/ facilitators have the right to apply penalties, disqualify and dismiss any registered participants from the competition, at their discretion, at any stage of the competition."
    ],
    "generalRules": [
      "3.1 All participants are required to arrive at the designated competition venue at least 30 minutes prior to the scheduled start time. Latecomers will not be permitted to compete and will be disqualified from the event. Any participant who is unable to attend the competition due to unforeseen circumstances must notify the organizers as soon as possible.",
      "3.2 All participants are required to remain within the designated competition area once the event has begun. Leaving the venue during the competition is strictly prohibited, and any participant who does so will be disqualified from the event.",
      "3.3 All projects submitted for the competition must be created using only the components and materials provided in the designated robotics kit. Any additional components or materials are strictly prohibited.",
      "3.4 Once the event commences, all participating groups are strictly prohibited from communicating with any other groups until the end of the competition. Any attempt to communicate or collaborate with other groups will result in immediate disqualification.",
      "3.5  Facilitators reserve the right to edit the rules at any time and disqualify teams for reasons not stated in this list or take other action.",
      "3.6 Ignorance of rules does not justify rule breaking. If you have questions about any rules, contact our support."
    ],
    "participantsRequirement": [
      "4.1 Participants must adhere to a code of conduct that outlines expected behavior during the event, such as respect for other participants, non-discrimination, and ethical conduct.",
      "4.2 Participants are encouraged to leverage their creativity and knowledge in order to develop innovative solutions that address pressing environmental challenges.",
      "4.3 Participants must adhere to rules related to intellectual property rights, which could include restrictions on the use of copyrighted materials or ownership of the intellectual property developed during the event.",
      "4.4 Participants must adhere to health and safety regulations, such as wearing protective gear or following safety procedures when working with hazardous materials or equipment."
    ],
    "teamRequirement": [
      "5.1 All participants must form teams consisting of at least 3-4 members. Participants who do not have a team upon registration will be assigned to a team by the organizers. Teams will be created at random or based on participant preferences, if feasible.",
      "5.2 Participants may request to change teams prior to the start of the competition, but the organizers reserve the right to deny such requests. Each team will be given a team name and must work together throughout the competition."
    ],
    "__v": 0,
    "showGeneralConduct": true,
    "showGeneralRules": true,
    "showMechanics": true,
    "showParticipantsRequirement": true,
    "showTeamRequirement": true
  },
  {
    "_id": "681b66b0426531b6e127dac0",
    "title": "MOBILE CONTROLLED E-ROBOT v1",
    "description": " Using the Erobot mobile controlled robot, your goal is to navigate your customized vehicle through a track outlined with electrical tape, completing three full laps faster than your opponent.",
    "imageUrl": "/uploads/1746626224406.jpg",
    "mechanics": [
      "Maneuver your robots towards the goal! The tournament is a head-to-head race between two “remote controlled” robot cars aiming for the finish line. Players’ primary goal is to reach the end line completing full three (3) laps. The competition follows a single-elimination format, with each round narrowing down the field of participants until the top 3 is decided.The mechanics of the game are as follows:",
      "A. ROBOT CAR SPECIFICATIONS",
      "1. All participants were allowed to use the Erobot mobile controlled robot.",
      "2. Participants can only control one (1) robot each.",
      "3. Allow participants to customize the appearance of their cars but limit modifications to maintain fair competition.",
      "B. REMOTE CONTROL REGULATIONS",
      "1. Participants are allowed to use their own remote controls application. The robot car must be remote controlled through Wi-fi or Bluetooth.",
      "C. TRACK DESIGN",
      "1. The track is created by an instructor wherein the boundaries of the track is outlined with electrical tape.",
      "Obstacle Challenges",
      "Obstacles will be added randomly every race that the robot may maneuver around or go through but may affect their speed in the race.",
      "Note: Players are only allowed to stay in the designated positions. Violating these rule will be a ground for disqualification. Refer to Figure 1 for the position designation",
      "D. LAP COMPLETION",
      "1. Participants must complete three laps around the track to finish the race. Five (5) points will be deducted every time the robot car crosses beyond the track.",
      "2. The participant with the fastest overall time to complete the 3 laps advances to the next round.",
      "E. TOURNAMENT",
      "Elimination",
      "1. The elimination round will follow a single-elimination tournament style following a sample bracket structure below.",
      "a. Divide participants into brackets for the single-elimination rounds.",
      "b. Each round consists of head-to-head races between two participants.",
      "c. Winners advance to the next round, while losers are eliminated from the competition."
    ],
    "generalConduct": [],
    "generalRules": [],
    "participantsRequirement": [],
    "teamRequirement": [
      "1. Announce the top 3 players based on their performance throughout the competition."
    ],
    "showMechanics": true,
    "showGeneralConduct": false,
    "showGeneralRules": false,
    "showParticipantsRequirement": false,
    "showTeamRequirement": true,
    "__v": 0
  },
  {
    "_id": "681b738b426531b6e127dad9",
    "title": "E-ROBO QUIZ BEE",
    "description": "Calling all bright minds from Erovoutika partner schools! Prepare for the E-ROBO QUIZ BEE, a battle of intellect focused on the fascinating world of robotics and automation.",
    "imageUrl": "/uploads/1746629515177.jpg",
    "mechanics": [
      "A. ELIGIBILITY",
      "1  The competition is open for all Erovoutika partner schools (high school and/or university).",
      "2 Only one (1) individual is allowed to represent the school/college/university.",
      "3 Individual to represent the school/college/university:",
      "a.  Should be a bonafide high school student of the school/college/university that he/she represents.",
      "b. Must be officially enrolled in the Academic Year 2024-2025",
      "c. Must be of good moral standing and of character.",
      "4 The school/college/university must submit a Certificate of Endorsement from the principal/dean/chair along with the registration or enrolment form of the participating student.",
      "5 All qualified participants shall accomplish their registration in the following link: googleforms.link",
      "6 Deadline of submission of the qualified institutions for the competition shall be submitted on or before April 30, 2024. Submissions after the specified date will not be accepted.",
      "B. SCORE AND POINTING SYSTEM",
      "1. The scope of the quiz bee is distributed as follows and will be drawn by the Panel of Judges:",
      "a. Robotics and Automation Concept - This topic pertains to subjects relating to but not limited to the principles, design, construction (including the hardware) and processes applied in robotics and automation. It may also include the evolution of the robotics throughout centuries including the cutting- edge automation technologies currently used in the industry.",
      "b. Electronics and Circuit Design - It refers to topics revolving around electronic components, circuit analysis, troubleshooting, design analysis, logic gates and analog and digital circuit applications.",
      "c. Programming - Focuses on programming syntax, functions and structuring, debugging and or analysing algorithm outputs (Python, C++ and Java).",
      "d. Sensors and Controls- Incudes all the functioning sensors, motors, microcontrollers and embedded systems specifically used and designed to control robots.",
      "2. All questions will be divided into three (3) rounds which can be a combination of objective and analytical questions. The pointing system is as follows:",
      "a. Objective - relates to conceptual, theoretical and trivial questions.",
      "b. Analytical - refers to questions which involves critical thinking, analysis and troubleshooting.",
      "3. Time allotment for each round is as follows:",
      "a.  Each easy round question shall be answered within ten (10) seconds only.",
      "b. Each moderate objective question type shall be answered within twenty-five (25) seconds only; moderate analytical question type shall be answered within one (1) minute only.",
      "c. Each difficult objective question type shall be answered within one (1) minute only; difficult analytical question type shall be answered within two (2) minutes only.",
      "C. MANNER OF ANSWERING",
      "1. Each participant shall bring their own white board, marker and board eraser.",
      "2. Every question will be read twice by the Quiz Master.",
      "3. Time limit starts upon the cue of the Quiz Master after the question has been read twice. That is the only time that quizzers can write anything to their white boards.",
      "4. Final answers should be written legibly and should be enclosed by a circle or rectangle. Answers not abiding to the aforementioned rule will not be accepted.",
      "5. In case of two (2) answers written on the board both enclosed by circle or rectangle, the first answer will be considered.",
      "6. Watchers will be assigned per column of quizzers to ensure that no alterations will be made to the Final Answer.",
      "7. After the time limit, the Quiz Master will ask the quizzers to raise their boards and announce the final answer. Quizzers who got the correct answer shall remain holding their boards up while the Quiz Master and the Panel of Judges record the points.",
      "Note: Item 7 can be revised within the discretion of the Panel of Judges.",
      "8. Wrong spelling in the Final answer will be considered wrong.",
      "9. No point deduction will be applied for quizzers with no answer and wrong answer.",
      "10. Any reference book, e-books, notebooks, cell phones and other devices and materials that can contain any form of information is strictly prohibited during the conduct of the competition. Violation to the said rule shall consider the participant as forfeited.",
      "11. In case of tie, a Clincher round will commence. The question for this round can either be an objective or analytical question type drawn by the Panel of Judges. The aforementioned rules for the Easy, Moderate and Difficult round also applies with the Clincher round and will continue until the tie has been broken.",
      "D. CLARIFICATIONS",
      "1. Only the quizzer is allowed to raise clarifications on either the question or answer given at a specific time.",
      "2. All clarifications shall be directed towards the Panel of Judges and concerns can only be raised and addressed during the allotted time for each question.",
      "3. Observed proper manner and decorum while raising any clarifications. Any disrespectful and or derogatory acts during the competition shall be dealt with corresponding penalty and will be decided by Erovoutika which may mean disqualification from the E-Robo Quiz Bee or not permitting the concerned body to participate in any future quiz bee organized by Erovoutika.",
      "4. Decision from the Panel of Judges is FINAL AND IRREVOCABLE.",
      "5. Erovoutika has the authority to change any part of the rules and regulations to further enhance the conduct of the quiz competition.",
      "E. PANEL OF UDGES",
      "1. The Panel of Judges consists of a chairperson and three (3) members.",
      "2. Any member of the Panel shall have no affiliation between any of the quizzers.",
      "F. MISCELLANEOUS",
      "1. Miscellaneous fees of each participant such as transportation, accommodation, food allowance, registration fee shall be shouldered by the represented school/college/university."
    ],
    "generalConduct": [],
    "generalRules": [],
    "participantsRequirement": [],
    "teamRequirement": [],
    "showMechanics": true,
    "showGeneralConduct": false,
    "showGeneralRules": false,
    "showParticipantsRequirement": false,
    "showTeamRequirement": false,
    "__v": 0
  }
]